Revit 2025 API
StructDeckEmbeddingType Enumeration
 Used in class CompoundStructure to specify the usage of a layer whose function is StructuralDeck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructDeckEmbeddingType
Public Enumeration StructDeckEmbeddingType
public enum class StructDeckEmbeddingType
type StructDeckEmbeddingType
Members
Member name | Value | Description
MergeWithLayerAbove | 0 |  Bound layer above.
Standalone | 1 |  Standalone deck.
Invalid | -1 |  Invalid usage.
See Also
Reference
Autodesk.Revit.DB Namespace